tests/fixtures/onec/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject><Document><Properties><Name>ЗаказКлиента</Name></Properties><ChildObjects><Attribute><Properties><Name>Товар</Name><Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type></Properties></Attribute><TabularSection><Properties><Name>Товары</Name></Properties><ChildObjects><Attribute><Properties><Name>Номенклатура</Name><Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type></Properties></Attribute></ChildObjects></TabularSection></ChildObjects></Document></MetaDataObject>

tests/fixtures/onec/Documents/ЗаказКлиента/Ext/ObjectModule.bsl
&НаСервере
Процедура ОбработкаПроведения(Отказ)
    ЦенообразованиеСервер.ПолучитьЦену();
    рАсСчИтАтЬсУмМу();
    Движения.ОстаткиТоваров.Добавить();
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |   Цены.Номенклатура
    |ИЗ
    |   РегистрСведений.Цены КАК Цены";
    сПрАвОчНиКи.Номенклатура.НайтиПоКоду("1");
КонецПроцедуры

Функция РассчитатьСумму()
    Возврат 100;
КонецФункции

Процедура ДинамическийЗапрос(Условие)
    Запрос.Текст = "ВЫБРАТЬ * ИЗ РегистрСведений.Цены КАК Цены " + Условие;
КонецПроцедуры

Процедура ПростоСообщение()
    Сообщить("ВЫБРАТЬ * ИЗ РегистрСведений.Цены");
КонецПроцедуры

Процедура ОстаткиИЦены()
    Запрос.Текст = "ВЫБРАТЬ Остатки.Номенклатура
    |ИЗ РегистрНакопления.ОстаткиТоваров.Остатки() КАК Остатки
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены КАК Цены
    |ПО Остатки.Номенклатура = Цены.Номенклатура";
КонецПроцедуры

Процедура ВызватьДинамически(ИмяМетода)
    Выполнить(ИмяМетода + "()");
КонецПроцедуры

Процедура ПроверитьГлобальныйВызов()
    ОбщаяФункция();
КонецПроцедуры

Процедура СтрокиДокумента()
    Запрос.Текст = "ВЫБРАТЬ Товары.Номенклатура ИЗ Документ.ЗаказКлиента.Товары КАК Товары";
КонецПроцедуры

Процедура ЗапросВКонструкторе()
    Запрос = Новый Запрос("ВЫБРАТЬ Цены.Цена ИЗ РегистрСведений.Цены КАК Цены");
КонецПроцедуры

Процедура СобранныйЗапрос()
    ТекстЗапроса = "ВЫБРАТЬ Цены.Цена ИЗ ";
    ТекстЗапроса = ТекстЗапроса + "РегистрСведений.Цены КАК Цены";
    Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура ЧастичноСобранныйЗапрос(Условие)
    ТекстЗапроса = "ВЫБРАТЬ Цены.Цена ИЗ РегистрСведений.Цены КАК Цены ";
    ТекстЗапроса = ТекстЗапроса + Условие;
    Запрос = Новый Запрос(ТекстЗапроса);
КонецПроцедуры

Процедура ПерезаписанныйЗапрос()
    ТекстЗапроса = "ВЫБРАТЬ Цены.Цена ИЗ РегистрСведений.Цены КАК Цены";
    ТекстЗапроса = ПолучитьТекстЗапроса();
    Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура ЗапросПослеВетвления()
    ТекстЗапроса = "ВЫБРАТЬ Цены.Цена ИЗ РегистрСведений.Цены КАК Цены";
    Если Истина Тогда
        ТекстЗапроса = ПолучитьТекстЗапроса();
    КонецЕсли;
    Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура НастроитьДвижения()
    Движения.ОстаткиТоваров.Записывать = Истина;
КонецПроцедуры

Процедура ОтключитьДвижения()
    Движения.ОстаткиТоваров.Записывать = Ложь;
КонецПроцедуры
